# Напишите программу, которая принимает на вход координаты двух точек
#  и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21


def distance_two_points():
    print("Введите координаты 1й точки")
    x1 = (int)(input())
    y1 = (int)(input())
    print("Введите координаты 2й точки")
    x2 = (int)(input())
    y2 = (int)(input())
    distance = ((y2 - y1) ** 2 + (x2 - x1) ** 2) ** (0.5)
    print(f"Расстояние между двумя точками равно: {format(distance,'.1f')}")


distance_two_points()
