# 2 Задайте натуральное число N. Напишите программу, которая составит
# список простых множителей числа N.
#
# *Пример*
#
# - при N=236     ->        [2, 2, 59]


n = int(input("Введите число N: "))
list = []
while n > 1:
    for i in range(2, n + 1):
        if n % i == 0:
            list.append(i)
            n = int(n / i)
            break
print(list)
